#### Operations

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})

# 要顯示幾筆資料
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [3]:
df['col2'].unique()

array([444, 555, 666])

unique 可以找到獨一無二的值。

In [4]:
len(df['col2'].unique())

3

In [5]:
df['col2'].nunique()

3

可以不用回傳出 array。
1. 可以用 len 的 func 來看獨一無二值有幾個。
2. 可以用 pandas 內建的 func nunique 來看獨一無二值有幾個。

In [6]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

可以計算出在這欄位裡頭，每一個值出現過幾次。

In [7]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [8]:
df[df['col1'] > 2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [9]:
df['col1'] > 2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [10]:
df[(df['col1'] > 2) & (df['col2'] == 444)]

   col1  col2 col3
3     4   444  xyz

In [11]:
def times2(x):
    return x * 2

In [12]:
df['col1']

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [13]:
df['col1'].sum()

10

In [14]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

可以自訂一個 func ，並利用 pandas 內建的 apply func ，來執行自訂的 func。

In [15]:
df['col3']

0    abc
1    def
2    ghi
3    xyz
Name: col3, dtype: object

In [16]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

除了可以利用 apply 來執行自訂的 func 外，也可以執行 python 自訂的 func。

In [17]:
df['col2'].apply(lambda x : x * 2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

利用 lambda ，就可以不用自訂 func。

In [18]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [19]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

可以查看目前的 DataFrame 欄位是什麼。

In [20]:
df.index

RangeIndex(start=0, stop=4, step=1)

可以查看目前的 DataFrame index 是什麼。

In [21]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

用 sort_values 可以將指定的欄位值進行排序。

In [22]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

可以找到在這個 DataFrame 裡面的值，是不是有 NaN ，並回傳 bool。

In [23]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
        'B':['one','one','two','two','one','one'],
        'C':['x','y','x','y','x','y'],
        'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [24]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [25]:
df.pivot_table(values = 'D', index = ['A','B'], columns = ['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

樞紐分析表。